app/controllers/orders_controller.rb

  def new
	@cart = current_cart
	if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 6]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 6]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(current_cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["address", ""], ["email", ""], ["pay_type", ""], ["created_at", "2015-06-11 23:44:34.382394"], ["updated_at", "2015-06-11 23:44:34.382394"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 7]]