app/controllers/products_controller.rb

  def index
    if params[:search]
      @products = Product.search(params[:search]).order("created_at DESC")
    else
      @products = Product.all
---
SELECT "products".* FROM "products" WHERE (title like '%developers%')  ORDER BY created_at DESC
SELECT "products".* FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "abc"], ["description", "a"], ["image_url", "s"], ["price", 0.0], ["created_at", "2015-06-05 02:39:22.557160"], ["updated_at", "2015-06-05 02:39:22.557160"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 22.0], ["updated_at", "2015-06-05 02:53:17.637109"], ["id", 2]]