app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users"  ORDER BY "users"."name" ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "hashed_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)